In [1]:
import pandas as pd

# Reading 2 columns from a csv file and ignore others
# Fastest method to read from a csv file
# Define type of each column before actually reading the csv

ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [2]:
# To read only 2 specific columns
ufo = pd.read_csv('http://bit.ly/uforeports', usecols=[0, 4])
ufo.columns

Index(['City', 'Time'], dtype='object')

In [3]:
# To pull out the first few rows
ufo = pd.read_csv('http://bit.ly/uforeports', nrows=4)
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00
3      Abilene              NaN           DISK    KS   6/1/1931 13:00

In [4]:
# How do dataframes and series work with regard to selecting individual entries
# and iteration (for X in userdata:)
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke
Abilene

In [5]:
# for iterating through a dataframe
for index, row in ufo.iterrows():
    print(index, row.City, row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO
3 Abilene KS

In [6]:
# Best way to drop every non-numeric column from a dataframe
drinks = pd.read_csv('https://bit.ly/drinksbycountry')
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [7]:
# To select only the numeric datatypes
import numpy as np
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [9]:
drinks.describe(include='all')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,193
unique,193,NaN,NaN,NaN,NaN,6
top,Saudi Arabia,NaN,NaN,NaN,NaN,Africa
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN

In [10]:
drinks.describe(include=['object', 'float64'])

             country  total_litres_of_pure_alcohol continent
count            193                    193.000000       193
unique           193                           NaN         6
top     Saudi Arabia                           NaN    Africa
freq               1                           NaN        53
mean             NaN                      4.717098       NaN
std              NaN                      3.773298       NaN
min              NaN                      0.000000       NaN
25%              NaN                      1.300000       NaN
50%              NaN                      4.200000       NaN
75%              NaN                      7.200000       NaN
max              NaN                     14.400000       NaN